#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.index must be replaced
-/+ resource "google_storage_bucket_object" "index" {
        bucket         = "www.sourpatch.net"
      ~ content_type   = "text/html; charset=utf-8" -> (known after apply)
      ~ crc32c         = "cCqi/g==" -> (known after apply)
      ~ detect_md5hash = "CA4DkhEGHx39fNDNf15eaQ==" -> "different hash" # forces replacement
      ~ id             = "www.sourpatch.net-index.html" -> (known after apply)
      ~ md5hash        = "CA4DkhEGHx39fNDNf15eaQ==" -> (known after apply)
        name           = "index.html"
      ~ output_name    = "index.html" -> (known after apply)
      ~ self_link      = "https://www.googleapis.com/storage/v1/b/www.sourpatch.net/o/index.html" -> (known after apply)
        source         = "pages/index.html"
      ~ storage_class  = "STANDARD" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
